app/controllers/posts_controller.rb

INSERT INTO "posts" ("title", "body", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "railsの勉強をしています"], ["body", "データベースが難しい"], ["created_at", "2019-08-01 04:56:27.686038"], ["updated_at", "2019-08-01 04:56:27.686038"]]
---
    def create
        # ストロングパラメーターを使用
         post = Post.new(post_params)
        # DBへ保存する
         post.save

SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
DELETE FROM "posts" WHERE "posts"."id" = ?  [["id", 1]]
---
    def destroy
        post = Post.find(params[:id])
        post.destroy